1Cvgnqualitysmoke/src/DataProcessors/ЗаполнитьМетаданныеБезПрефикса/ЗаполнитьМетаданныеБезПрефикса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнитьМетаданныеБезПрефикса</name>
</mdclass:DataProcessor>

1Cvgnqualitysmoke/src/Catalogs/ОписаниеИзменений/ОписаниеИзменений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОписаниеИзменений</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КонфигурацияИсточник</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>КонфигурацияПриемник</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзменения</name>
    <type>
      <types>EnumRef.ТипыИзменений</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаМетаданных</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ГруппаМетаданных</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метаданные</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Метаданные</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКонтуре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПровереноПрограммистом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПровереноКонсультантом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПровереноКлиентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПрограмист</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКонсультант</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МетаданныеБезПрефикса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФункциональныйУчасток</name>
    <type>
      <types>CatalogRef.ФункциональныеУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВопросКонсультанту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВопросЗаказчику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимаДоработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимоРазделениеФункциональности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статистика</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеРасширения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОписаниеСвойств</name>
    <attributes>
      <name>СвойствоМетаданных</name>
      <type>
        <types>CatalogRef.СвойстваМетаданных</types>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойствМетаданных</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствМетаданных</types>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипИзменения</name>
      <type>
        <types>EnumRef.ТипыИзменений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязанныеОбъекты</name>
    <attributes>
      <name>СвязанныйОбъект</name>
      <type>
        <types>CatalogRef.Подсистемы</types>
        <types>CatalogRef.ОписаниеИзменений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

1Cvgnqualitysmoke/src/DataProcessors/ЗаполнитьМетаданныеБезПрефикса/Forms/Форма/Module.bsl
&НаСервереБезКонтекста
Процедура ЗаполнитьМетаданныеБезПрефиксаНаСервере()
	Запрос6 = Новый Запрос("ВЫБРАТЬ
	|	ОписаниеИзменений.Ссылка КАК Ссылка,
	|	ОписаниеИзменений.Метаданные КАК Метаданные
	|ИЗ
	|	Справочник.ОписаниеИзменений КАК ОписаниеИзменений
	|ГДЕ
	|	(ВЫРАЗИТЬ(ОписаниеИзменений.МетаданныеБезПрефикса КАК СТРОКА(5))) = """"
	|	И (ПОДСТРОКА(ВЫРАЗИТЬ(ОписаниеИзменений.Метаданные КАК СТРОКА(10)), 3, 1) = ""_""
	|			ИЛИ ПОДСТРОКА(ВЫРАЗИТЬ(ОписаниеИзменений.Метаданные КАК СТРОКА(10)), 4, 1) = ""_"")");
	
	Запрос6.УстановитьПараметр("Символ", "_");
	
	РезультатЗапроса = Запрос6.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		Объект_ = Выборка.Ссылка.ПолучитьОбъект();
		ПервыйСимвол =  СтрНайти(Объект_.Метаданные,"_",,,);
		
		Если НЕ ПервыйСимвол = 0 Тогда
			
			СтрокаБезПрефикса = Прав(Объект_.Метаданные, СтрДлина(Объект_.Метаданные) - ПервыйСимвол);
			Объект_.МетаданныеБезПрефикса = СтрокаБезПрефикса;
			Объект_.ЗАписать();
			
		КонецЕсли; 
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМетаданныеБезПрефикса(Команда)
	ЗаполнитьМетаданныеБезПрефиксаНаСервере();
КонецПроцедуры
